package oop01.syntax;
/*
Data : 
Autor : 
Desc : 메서드 문법

메소드 개요 
함수 = method =function =procedore
1)메소드는 리턴값이 있어야 하는데 없으면 void 기술 
2)메소드는 함수 이름 다음에 괄호가 있어야함
3)메소드는 필요한 경우 메소드 이름(파라미터) 형태를 

메소드  Syntax
-c언어와 함수와 동일,
-데이터 처리 가능한 구현
-리턴값에 ㅇ없는 메소드는 void 지정
-메소드가 받는 인수 와 데이터타입은 메소드를 호출하는 쪽과
일치해야함

메소드의 종류
-static 메소드 =정적메소드, 클래스 메소드 static 이 뿜은 메소드  (오버라이딩 사용 못함) 
인스턴스 멤버를 사용할 수없다. 
인스턴스를 사용하지 않아도 사용가능 
-non -static 메소드 = 일반 메소드, 인스턴스 메소드, static 에 안붙어있다.
멤변 중 모든 인스턴스에 공통 사용하는 메소드
메소드 작업 수행시 인변을 필요로 하는 메소드

오버로딩
메소드 중복, 파라미터 개수나 타입만 다름
메소드 이름은 동일하다. 
*/
public class No04_MethodSyntax {

}
